benchmarks/results/l4-2026-06-28/results/awq-k6.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: sweep.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 6m30s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 6m0s over 4 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   0% ] 001/100 VUs  0m01.0s/6m00.0s

running (0m02.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m02.0s/6m00.0s

running (0m03.0s), 001/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m03.0s/6m00.0s

running (0m04.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m04.0s/6m00.0s

running (0m05.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   1% ] 001/100 VUs  0m05.0s/6m00.0s

running (0m06.0s), 001/100 VUs, 1 complete and 0 interrupted iterations
default   [   2% ] 001/100 VUs  0m06.0s/6m00.0s

running (0m07.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m07.0s/6m00.0s

running (0m08.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m08.0s/6m00.0s

running (0m09.0s), 002/100 VUs, 2 complete and 0 interrupted iterations
default   [   2% ] 002/100 VUs  0m09.0s/6m00.0s

running (0m10.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m10.0s/6m00.0s

running (0m11.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m11.0s/6m00.0s

running (0m12.0s), 002/100 VUs, 4 complete and 0 interrupted iterations
default   [   3% ] 002/100 VUs  0m12.0s/6m00.0s

running (0m13.0s), 002/100 VUs, 6 complete and 0 interrupted iterations
default   [   4% ] 002/100 VUs  0m13.0s/6m00.0s

running (0m14.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m14.0s/6m00.0s

running (0m15.0s), 003/100 VUs, 6 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m15.0s/6m00.0s

running (0m16.0s), 003/100 VUs, 8 complete and 0 interrupted iterations
default   [   4% ] 003/100 VUs  0m16.0s/6m00.0s

running (0m17.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m17.0s/6m00.0s

running (0m18.0s), 003/100 VUs, 9 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m18.0s/6m00.0s

running (0m19.0s), 003/100 VUs, 11 complete and 0 interrupted iterations
default   [   5% ] 003/100 VUs  0m19.0s/6m00.0s

running (0m20.0s), 003/100 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 003/100 VUs  0m20.0s/6m00.0s

running (0m21.0s), 004/100 VUs, 12 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m21.0s/6m00.0s

running (0m22.0s), 004/100 VUs, 14 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m22.0s/6m00.0s

running (0m23.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [   6% ] 004/100 VUs  0m23.0s/6m00.0s

running (0m24.0s), 004/100 VUs, 16 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m24.0s/6m00.0s

running (0m25.0s), 004/100 VUs, 18 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m25.0s/6m00.0s

running (0m26.0s), 004/100 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 004/100 VUs  0m26.0s/6m00.0s

running (0m27.0s), 005/100 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 005/100 VUs  0m27.0s/6m00.0s

running (0m28.0s), 005/100 VUs, 22 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m28.0s/6m00.0s

running (0m29.0s), 005/100 VUs, 24 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m29.0s/6m00.0s

running (0m30.0s), 005/100 VUs, 26 complete and 0 interrupted iterations
default   [   8% ] 005/100 VUs  0m30.0s/6m00.0s

running (0m31.0s), 005/100 VUs, 27 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m31.0s/6m00.0s

running (0m32.0s), 005/100 VUs, 29 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m32.0s/6m00.0s

running (0m33.0s), 005/100 VUs, 31 complete and 0 interrupted iterations
default   [   9% ] 005/100 VUs  0m33.0s/6m00.0s

running (0m34.0s), 006/100 VUs, 32 complete and 0 interrupted iterations
default   [   9% ] 006/100 VUs  0m34.0s/6m00.0s

running (0m35.0s), 006/100 VUs, 34 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m35.0s/6m00.0s

running (0m36.0s), 006/100 VUs, 36 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m36.0s/6m00.0s

running (0m37.0s), 006/100 VUs, 38 complete and 0 interrupted iterations
default   [  10% ] 006/100 VUs  0m37.0s/6m00.0s

running (0m38.0s), 006/100 VUs, 40 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m38.0s/6m00.0s

running (0m39.0s), 006/100 VUs, 42 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m39.0s/6m00.0s

running (0m40.0s), 006/100 VUs, 44 complete and 0 interrupted iterations
default   [  11% ] 006/100 VUs  0m40.0s/6m00.0s

running (0m41.0s), 007/100 VUs, 46 complete and 0 interrupted iterations
default   [  11% ] 007/100 VUs  0m41.0s/6m00.0s

running (0m42.0s), 007/100 VUs, 48 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m42.0s/6m00.0s

running (0m43.0s), 007/100 VUs, 50 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m43.0s/6m00.0s

running (0m44.0s), 007/100 VUs, 53 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m44.0s/6m00.0s

running (0m45.0s), 007/100 VUs, 55 complete and 0 interrupted iterations
default   [  12% ] 007/100 VUs  0m45.0s/6m00.0s

running (0m46.0s), 007/100 VUs, 57 complete and 0 interrupted iterations
default   [  13% ] 007/100 VUs  0m46.0s/6m00.0s

running (0m47.0s), 008/100 VUs, 60 complete and 0 interrupted iterations
default   [  13% ] 008/100 VUs  0m47.0s/6m00.0s

running (0m48.0s), 008/100 VUs, 62 complete and 0 interrupted iterations
default   [  13% ] 008/100 VUs  0m48.0s/6m00.0s

running (0m49.0s), 008/100 VUs, 64 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m49.0s/6m00.0s

running (0m50.0s), 008/100 VUs, 68 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m50.0s/6m00.0s

running (0m51.0s), 008/100 VUs, 69 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m51.0s/6m00.0s

running (0m52.0s), 008/100 VUs, 72 complete and 0 interrupted iterations
default   [  14% ] 008/100 VUs  0m52.0s/6m00.0s

running (0m53.0s), 008/100 VUs, 76 complete and 0 interrupted iterations
default   [  15% ] 008/100 VUs  0m53.0s/6m00.0s

running (0m54.0s), 009/100 VUs, 77 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m54.0s/6m00.0s

running (0m55.0s), 009/100 VUs, 80 complete and 0 interrupted iterations
default   [  15% ] 009/100 VUs  0m55.0s/6m00.0s

running (0m56.0s), 009/100 VUs, 83 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m56.0s/6m00.0s

running (0m57.0s), 009/100 VUs, 86 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m57.0s/6m00.0s

running (0m58.0s), 009/100 VUs, 89 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m58.0s/6m00.0s

running (0m59.0s), 009/100 VUs, 92 complete and 0 interrupted iterations
default   [  16% ] 009/100 VUs  0m59.0s/6m00.0s

running (1m00.0s), 009/100 VUs, 95 complete and 0 interrupted iterations
default   [  17% ] 009/100 VUs  1m00.0s/6m00.0s

running (1m01.0s), 010/100 VUs, 98 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  1m01.0s/6m00.0s

running (1m02.0s), 010/100 VUs, 101 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  1m02.0s/6m00.0s

running (1m03.0s), 010/100 VUs, 104 complete and 0 interrupted iterations
default   [  17% ] 010/100 VUs  1m03.0s/6m00.0s

running (1m04.0s), 011/100 VUs, 108 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  1m04.0s/6m00.0s

running (1m05.0s), 011/100 VUs, 111 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  1m05.0s/6m00.0s

running (1m06.0s), 011/100 VUs, 114 complete and 0 interrupted iterations
default   [  18% ] 011/100 VUs  1m06.0s/6m00.0s

running (1m07.0s), 012/100 VUs, 119 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  1m07.0s/6m00.0s

running (1m08.0s), 012/100 VUs, 121 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  1m08.0s/6m00.0s

running (1m09.0s), 012/100 VUs, 124 complete and 0 interrupted iterations
default   [  19% ] 012/100 VUs  1m09.0s/6m00.0s

running (1m10.0s), 013/100 VUs, 131 complete and 0 interrupted iterations
default   [  19% ] 013/100 VUs  1m10.0s/6m00.0s

running (1m11.0s), 013/100 VUs, 133 complete and 0 interrupted iterations
default   [  20% ] 013/100 VUs  1m11.0s/6m00.0s

running (1m12.0s), 013/100 VUs, 136 complete and 0 interrupted iterations
default   [  20% ] 013/100 VUs  1m12.0s/6m00.0s

running (1m13.0s), 014/100 VUs, 144 complete and 0 interrupted iterations
default   [  20% ] 014/100 VUs  1m13.0s/6m00.0s

running (1m14.0s), 014/100 VUs, 146 complete and 0 interrupted iterations
default   [  21% ] 014/100 VUs  1m14.0s/6m00.0s

running (1m15.0s), 014/100 VUs, 149 complete and 0 interrupted iterations
default   [  21% ] 014/100 VUs  1m15.0s/6m00.0s

running (1m16.0s), 015/100 VUs, 157 complete and 0 interrupted iterations
default   [  21% ] 015/100 VUs  1m16.0s/6m00.0s

running (1m17.0s), 015/100 VUs, 160 complete and 0 interrupted iterations
default   [  21% ] 015/100 VUs  1m17.0s/6m00.0s

running (1m18.0s), 015/100 VUs, 163 complete and 0 interrupted iterations
default   [  22% ] 015/100 VUs  1m18.0s/6m00.0s

running (1m19.0s), 016/100 VUs, 171 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  1m19.0s/6m00.0s

running (1m20.0s), 016/100 VUs, 175 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  1m20.0s/6m00.0s

running (1m21.0s), 016/100 VUs, 177 complete and 0 interrupted iterations
default   [  22% ] 016/100 VUs  1m21.0s/6m00.0s

running (1m22.0s), 017/100 VUs, 187 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  1m22.0s/6m00.0s

running (1m23.0s), 017/100 VUs, 190 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  1m23.0s/6m00.0s

running (1m24.0s), 017/100 VUs, 193 complete and 0 interrupted iterations
default   [  23% ] 017/100 VUs  1m24.0s/6m00.0s

running (1m25.0s), 018/100 VUs, 204 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  1m25.0s/6m00.0s

running (1m26.0s), 018/100 VUs, 206 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  1m26.0s/6m00.0s

running (1m27.0s), 018/100 VUs, 209 complete and 0 interrupted iterations
default   [  24% ] 018/100 VUs  1m27.0s/6m00.0s

running (1m28.0s), 019/100 VUs, 219 complete and 0 interrupted iterations
default   [  24% ] 019/100 VUs  1m28.0s/6m00.0s

running (1m29.0s), 019/100 VUs, 224 complete and 0 interrupted iterations
default   [  25% ] 019/100 VUs  1m29.0s/6m00.0s

running (1m30.0s), 019/100 VUs, 226 complete and 0 interrupted iterations
default   [  25% ] 019/100 VUs  1m30.0s/6m00.0s

running (1m31.0s), 020/100 VUs, 235 complete and 0 interrupted iterations
default   [  25% ] 020/100 VUs  1m31.0s/6m00.0s

running (1m32.0s), 020/100 VUs, 243 complete and 0 interrupted iterations
default   [  26% ] 020/100 VUs  1m32.0s/6m00.0s

running (1m33.0s), 020/100 VUs, 245 complete and 0 interrupted iterations
default   [  26% ] 020/100 VUs  1m33.0s/6m00.0s

running (1m34.0s), 021/100 VUs, 251 complete and 0 interrupted iterations
default   [  26% ] 021/100 VUs  1m34.0s/6m00.0s

running (1m35.0s), 021/100 VUs, 261 complete and 0 interrupted iterations
default   [  26% ] 021/100 VUs  1m35.0s/6m00.0s

running (1m36.0s), 021/100 VUs, 264 complete and 0 interrupted iterations
default   [  27% ] 021/100 VUs  1m36.0s/6m00.0s

running (1m37.0s), 022/100 VUs, 271 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  1m37.0s/6m00.0s

running (1m38.0s), 022/100 VUs, 281 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  1m38.0s/6m00.0s

running (1m39.0s), 022/100 VUs, 284 complete and 0 interrupted iterations
default   [  27% ] 022/100 VUs  1m39.0s/6m00.0s

running (1m40.0s), 023/100 VUs, 290 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  1m40.0s/6m00.0s

running (1m41.0s), 023/100 VUs, 298 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  1m41.0s/6m00.0s

running (1m42.0s), 023/100 VUs, 306 complete and 0 interrupted iterations
default   [  28% ] 023/100 VUs  1m42.0s/6m00.0s

running (1m43.0s), 024/100 VUs, 311 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  1m43.0s/6m00.0s

running (1m44.0s), 024/100 VUs, 317 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  1m44.0s/6m00.0s

running (1m45.0s), 024/100 VUs, 327 complete and 0 interrupted iterations
default   [  29% ] 024/100 VUs  1m45.0s/6m00.0s

running (1m46.0s), 025/100 VUs, 332 complete and 0 interrupted iterations
default   [  29% ] 025/100 VUs  1m46.0s/6m00.0s

running (1m47.0s), 025/100 VUs, 339 complete and 0 interrupted iterations
default   [  30% ] 025/100 VUs  1m47.0s/6m00.0s

running (1m48.0s), 025/100 VUs, 348 complete and 0 interrupted iterations
default   [  30% ] 025/100 VUs  1m48.0s/6m00.0s

running (1m49.0s), 026/100 VUs, 355 complete and 0 interrupted iterations
default   [  30% ] 026/100 VUs  1m49.0s/6m00.0s

running (1m50.0s), 026/100 VUs, 362 complete and 0 interrupted iterations
default   [  31% ] 026/100 VUs  1m50.0s/6m00.0s

running (1m51.0s), 026/100 VUs, 369 complete and 0 interrupted iterations
default   [  31% ] 026/100 VUs  1m51.0s/6m00.0s

running (1m52.0s), 027/100 VUs, 380 complete and 0 interrupted iterations
default   [  31% ] 027/100 VUs  1m52.0s/6m00.0s

running (1m53.0s), 027/100 VUs, 385 complete and 0 interrupted iterations
default   [  31% ] 027/100 VUs  1m53.0s/6m00.0s

running (1m54.0s), 027/100 VUs, 392 complete and 0 interrupted iterations
default   [  32% ] 027/100 VUs  1m54.0s/6m00.0s

running (1m55.0s), 028/100 VUs, 404 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  1m55.0s/6m00.0s

running (1m56.0s), 028/100 VUs, 409 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  1m56.0s/6m00.0s

running (1m57.0s), 028/100 VUs, 415 complete and 0 interrupted iterations
default   [  32% ] 028/100 VUs  1m57.0s/6m00.0s

running (1m58.0s), 029/100 VUs, 425 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  1m58.0s/6m00.0s

running (1m59.0s), 029/100 VUs, 436 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  1m59.0s/6m00.0s

running (2m00.0s), 029/100 VUs, 441 complete and 0 interrupted iterations
default   [  33% ] 029/100 VUs  2m00.0s/6m00.0s

running (2m01.0s), 030/100 VUs, 449 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  2m01.0s/6m00.0s

running (2m02.0s), 030/100 VUs, 461 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  2m02.0s/6m00.0s

running (2m03.0s), 030/100 VUs, 467 complete and 0 interrupted iterations
default   [  34% ] 030/100 VUs  2m03.0s/6m00.0s

running (2m04.0s), 031/100 VUs, 476 complete and 0 interrupted iterations
default   [  34% ] 031/100 VUs  2m04.0s/6m00.0s

running (2m05.0s), 031/100 VUs, 486 complete and 0 interrupted iterations
default   [  35% ] 031/100 VUs  2m05.0s/6m00.0s

running (2m06.0s), 031/100 VUs, 495 complete and 0 interrupted iterations
default   [  35% ] 031/100 VUs  2m06.0s/6m00.0s

running (2m07.0s), 032/100 VUs, 502 complete and 0 interrupted iterations
default   [  35% ] 032/100 VUs  2m07.0s/6m00.0s

running (2m08.0s), 032/100 VUs, 512 complete and 0 interrupted iterations
default   [  36% ] 032/100 VUs  2m08.0s/6m00.0s

running (2m09.0s), 032/100 VUs, 523 complete and 0 interrupted iterations
default   [  36% ] 032/100 VUs  2m09.0s/6m00.0s

running (2m10.0s), 033/100 VUs, 530 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  2m10.0s/6m00.0s

running (2m11.0s), 033/100 VUs, 539 complete and 0 interrupted iterations
default   [  36% ] 033/100 VUs  2m11.0s/6m00.0s

running (2m12.0s), 033/100 VUs, 549 complete and 0 interrupted iterations
default   [  37% ] 033/100 VUs  2m12.0s/6m00.0s

running (2m13.0s), 034/100 VUs, 560 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  2m13.0s/6m00.0s

running (2m14.0s), 034/100 VUs, 567 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  2m14.0s/6m00.0s

running (2m15.0s), 034/100 VUs, 575 complete and 0 interrupted iterations
default   [  37% ] 034/100 VUs  2m15.0s/6m00.0s

running (2m16.0s), 035/100 VUs, 588 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  2m16.0s/6m00.0s

running (2m17.0s), 035/100 VUs, 595 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  2m17.0s/6m00.0s

running (2m18.0s), 035/100 VUs, 605 complete and 0 interrupted iterations
default   [  38% ] 035/100 VUs  2m18.0s/6m00.0s

running (2m19.0s), 036/100 VUs, 615 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  2m19.0s/6m00.0s

running (2m20.0s), 036/100 VUs, 628 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  2m20.0s/6m00.0s

running (2m21.0s), 036/100 VUs, 634 complete and 0 interrupted iterations
default   [  39% ] 036/100 VUs  2m21.0s/6m00.0s

running (2m22.0s), 037/100 VUs, 645 complete and 0 interrupted iterations
default   [  39% ] 037/100 VUs  2m22.0s/6m00.0s

running (2m23.0s), 037/100 VUs, 659 complete and 0 interrupted iterations
default   [  40% ] 037/100 VUs  2m23.0s/6m00.0s

running (2m24.0s), 037/100 VUs, 666 complete and 0 interrupted iterations
default   [  40% ] 037/100 VUs  2m24.0s/6m00.0s

running (2m25.0s), 038/100 VUs, 675 complete and 0 interrupted iterations
default   [  40% ] 038/100 VUs  2m25.0s/6m00.0s

running (2m26.0s), 038/100 VUs, 686 complete and 0 interrupted iterations
default   [  41% ] 038/100 VUs  2m26.0s/6m00.0s

running (2m27.0s), 038/100 VUs, 700 complete and 0 interrupted iterations
default   [  41% ] 038/100 VUs  2m27.0s/6m00.0s

running (2m28.0s), 039/100 VUs, 706 complete and 0 interrupted iterations
default   [  41% ] 039/100 VUs  2m28.0s/6m00.0s

running (2m29.0s), 039/100 VUs, 716 complete and 0 interrupted iterations
default   [  41% ] 039/100 VUs  2m29.0s/6m00.0s

running (2m30.0s), 039/100 VUs, 726 complete and 0 interrupted iterations
default   [  42% ] 039/100 VUs  2m30.0s/6m00.0s

running (2m31.0s), 040/100 VUs, 740 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  2m31.0s/6m00.0s

running (2m32.0s), 040/100 VUs, 747 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  2m32.0s/6m00.0s

running (2m33.0s), 040/100 VUs, 757 complete and 0 interrupted iterations
default   [  42% ] 040/100 VUs  2m33.0s/6m00.0s

running (2m34.0s), 041/100 VUs, 768 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  2m34.0s/6m00.0s

running (2m35.0s), 041/100 VUs, 781 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  2m35.0s/6m00.0s

running (2m36.0s), 041/100 VUs, 790 complete and 0 interrupted iterations
default   [  43% ] 041/100 VUs  2m36.0s/6m00.0s

running (2m37.0s), 042/100 VUs, 799 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  2m37.0s/6m00.0s

running (2m38.0s), 042/100 VUs, 814 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  2m38.0s/6m00.0s

running (2m39.0s), 042/100 VUs, 822 complete and 0 interrupted iterations
default   [  44% ] 042/100 VUs  2m39.0s/6m00.0s

running (2m40.0s), 043/100 VUs, 832 complete and 0 interrupted iterations
default   [  44% ] 043/100 VUs  2m40.0s/6m00.0s

running (2m41.0s), 043/100 VUs, 842 complete and 0 interrupted iterations
default   [  45% ] 043/100 VUs  2m41.0s/6m00.0s

running (2m42.0s), 043/100 VUs, 857 complete and 0 interrupted iterations
default   [  45% ] 043/100 VUs  2m42.0s/6m00.0s

running (2m43.0s), 044/100 VUs, 867 complete and 0 interrupted iterations
default   [  45% ] 044/100 VUs  2m43.0s/6m00.0s

running (2m44.0s), 044/100 VUs, 877 complete and 0 interrupted iterations
default   [  46% ] 044/100 VUs  2m44.0s/6m00.0s

running (2m45.0s), 044/100 VUs, 888 complete and 0 interrupted iterations
default   [  46% ] 044/100 VUs  2m45.0s/6m00.0s

running (2m46.0s), 045/100 VUs, 901 complete and 0 interrupted iterations
default   [  46% ] 045/100 VUs  2m46.0s/6m00.0s

running (2m47.0s), 045/100 VUs, 911 complete and 0 interrupted iterations
default   [  46% ] 045/100 VUs  2m47.0s/6m00.0s

running (2m48.0s), 045/100 VUs, 921 complete and 0 interrupted iterations
default   [  47% ] 045/100 VUs  2m48.0s/6m00.0s

running (2m49.0s), 046/100 VUs, 933 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  2m49.0s/6m00.0s

running (2m50.0s), 046/100 VUs, 946 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  2m50.0s/6m00.0s

running (2m51.0s), 046/100 VUs, 956 complete and 0 interrupted iterations
default   [  47% ] 046/100 VUs  2m51.0s/6m00.0s

running (2m52.0s), 047/100 VUs, 967 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  2m52.0s/6m00.0s

running (2m53.0s), 047/100 VUs, 980 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  2m53.0s/6m00.0s

running (2m54.0s), 047/100 VUs, 994 complete and 0 interrupted iterations
default   [  48% ] 047/100 VUs  2m54.0s/6m00.0s

running (2m55.0s), 048/100 VUs, 1003 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  2m55.0s/6m00.0s

running (2m56.0s), 048/100 VUs, 1014 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  2m56.0s/6m00.0s

running (2m57.0s), 048/100 VUs, 1027 complete and 0 interrupted iterations
default   [  49% ] 048/100 VUs  2m57.0s/6m00.0s

running (2m58.0s), 049/100 VUs, 1039 complete and 0 interrupted iterations
default   [  49% ] 049/100 VUs  2m58.0s/6m00.0s

running (2m59.0s), 049/100 VUs, 1050 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  2m59.0s/6m00.0s

running (3m00.0s), 049/100 VUs, 1062 complete and 0 interrupted iterations
default   [  50% ] 049/100 VUs  3m00.0s/6m00.0s

running (3m01.0s), 050/100 VUs, 1074 complete and 0 interrupted iterations
default   [  50% ] 050/100 VUs  3m01.0s/6m00.0s

running (3m02.0s), 050/100 VUs, 1088 complete and 0 interrupted iterations
default   [  51% ] 050/100 VUs  3m02.0s/6m00.0s

running (3m03.0s), 051/100 VUs, 1099 complete and 0 interrupted iterations
default   [  51% ] 051/100 VUs  3m03.0s/6m00.0s

running (3m04.0s), 051/100 VUs, 1110 complete and 0 interrupted iterations
default   [  51% ] 051/100 VUs  3m04.0s/6m00.0s

running (3m05.0s), 052/100 VUs, 1120 complete and 0 interrupted iterations
default   [  51% ] 052/100 VUs  3m05.0s/6m00.0s

running (3m06.0s), 052/100 VUs, 1137 complete and 0 interrupted iterations
default   [  52% ] 052/100 VUs  3m06.0s/6m00.0s

running (3m07.0s), 052/100 VUs, 1150 complete and 0 interrupted iterations
default   [  52% ] 052/100 VUs  3m07.0s/6m00.0s

running (3m08.0s), 053/100 VUs, 1159 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  3m08.0s/6m00.0s

running (3m09.0s), 053/100 VUs, 1172 complete and 0 interrupted iterations
default   [  52% ] 053/100 VUs  3m09.0s/6m00.0s

running (3m10.0s), 054/100 VUs, 1185 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  3m10.0s/6m00.0s

running (3m11.0s), 054/100 VUs, 1199 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  3m11.0s/6m00.0s

running (3m12.0s), 054/100 VUs, 1208 complete and 0 interrupted iterations
default   [  53% ] 054/100 VUs  3m12.0s/6m00.0s

running (3m13.0s), 055/100 VUs, 1222 complete and 0 interrupted iterations
default   [  54% ] 055/100 VUs  3m13.0s/6m00.0s

running (3m14.0s), 055/100 VUs, 1235 complete and 0 interrupted iterations
default   [  54% ] 055/100 VUs  3m14.0s/6m00.0s

running (3m15.0s), 056/100 VUs, 1253 complete and 0 interrupted iterations
default   [  54% ] 056/100 VUs  3m15.0s/6m00.0s

running (3m16.0s), 056/100 VUs, 1262 complete and 0 interrupted iterations
default   [  54% ] 056/100 VUs  3m16.0s/6m00.0s

running (3m17.0s), 057/100 VUs, 1271 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  3m17.0s/6m00.0s

running (3m18.0s), 057/100 VUs, 1287 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  3m18.0s/6m00.0s

running (3m19.0s), 057/100 VUs, 1300 complete and 0 interrupted iterations
default   [  55% ] 057/100 VUs  3m19.0s/6m00.0s

running (3m20.0s), 058/100 VUs, 1312 complete and 0 interrupted iterations
default   [  56% ] 058/100 VUs  3m20.0s/6m00.0s

running (3m21.0s), 058/100 VUs, 1324 complete and 0 interrupted iterations
default   [  56% ] 058/100 VUs  3m21.0s/6m00.0s

running (3m22.0s), 059/100 VUs, 1337 complete and 0 interrupted iterations
default   [  56% ] 059/100 VUs  3m22.0s/6m00.0s

running (3m23.0s), 059/100 VUs, 1348 complete and 0 interrupted iterations
default   [  56% ] 059/100 VUs  3m23.0s/6m00.0s

running (3m24.0s), 059/100 VUs, 1367 complete and 0 interrupted iterations
default   [  57% ] 059/100 VUs  3m24.0s/6m00.0s

running (3m25.0s), 060/100 VUs, 1376 complete and 0 interrupted iterations
default   [  57% ] 060/100 VUs  3m25.0s/6m00.0s

running (3m26.0s), 060/100 VUs, 1388 complete and 0 interrupted iterations
default   [  57% ] 060/100 VUs  3m26.0s/6m00.0s

running (3m27.0s), 061/100 VUs, 1403 complete and 0 interrupted iterations
default   [  57% ] 061/100 VUs  3m27.0s/6m00.0s

running (3m28.0s), 061/100 VUs, 1415 complete and 0 interrupted iterations
default   [  58% ] 061/100 VUs  3m28.0s/6m00.0s

running (3m29.0s), 062/100 VUs, 1430 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  3m29.0s/6m00.0s

running (3m30.0s), 062/100 VUs, 1438 complete and 0 interrupted iterations
default   [  58% ] 062/100 VUs  3m30.0s/6m00.0s

running (3m31.0s), 062/100 VUs, 1453 complete and 0 interrupted iterations
default   [  59% ] 062/100 VUs  3m31.0s/6m00.0s

running (3m32.0s), 063/100 VUs, 1467 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  3m32.0s/6m00.0s

running (3m33.0s), 063/100 VUs, 1484 complete and 0 interrupted iterations
default   [  59% ] 063/100 VUs  3m33.0s/6m00.0s

running (3m34.0s), 064/100 VUs, 1494 complete and 0 interrupted iterations
default   [  59% ] 064/100 VUs  3m34.0s/6m00.0s

running (3m35.0s), 064/100 VUs, 1505 complete and 0 interrupted iterations
default   [  60% ] 064/100 VUs  3m35.0s/6m00.0s

running (3m36.0s), 064/100 VUs, 1520 complete and 0 interrupted iterations
default   [  60% ] 064/100 VUs  3m36.0s/6m00.0s

running (3m37.0s), 065/100 VUs, 1531 complete and 0 interrupted iterations
default   [  60% ] 065/100 VUs  3m37.0s/6m00.0s

running (3m38.0s), 065/100 VUs, 1551 complete and 0 interrupted iterations
default   [  61% ] 065/100 VUs  3m38.0s/6m00.0s

running (3m39.0s), 066/100 VUs, 1562 complete and 0 interrupted iterations
default   [  61% ] 066/100 VUs  3m39.0s/6m00.0s

running (3m40.0s), 066/100 VUs, 1572 complete and 0 interrupted iterations
default   [  61% ] 066/100 VUs  3m40.0s/6m00.0s

running (3m41.0s), 067/100 VUs, 1585 complete and 0 interrupted iterations
default   [  61% ] 067/100 VUs  3m41.0s/6m00.0s

running (3m42.0s), 067/100 VUs, 1599 complete and 0 interrupted iterations
default   [  62% ] 067/100 VUs  3m42.0s/6m00.0s

running (3m43.0s), 067/100 VUs, 1616 complete and 0 interrupted iterations
default   [  62% ] 067/100 VUs  3m43.0s/6m00.0s

running (3m44.0s), 068/100 VUs, 1628 complete and 0 interrupted iterations
default   [  62% ] 068/100 VUs  3m44.0s/6m00.0s

running (3m45.0s), 068/100 VUs, 1638 complete and 0 interrupted iterations
default   [  62% ] 068/100 VUs  3m45.0s/6m00.0s

running (3m46.0s), 069/100 VUs, 1652 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  3m46.0s/6m00.0s

running (3m47.0s), 069/100 VUs, 1664 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  3m47.0s/6m00.0s

running (3m48.0s), 069/100 VUs, 1683 complete and 0 interrupted iterations
default   [  63% ] 069/100 VUs  3m48.0s/6m00.0s

running (3m49.0s), 070/100 VUs, 1696 complete and 0 interrupted iterations
default   [  64% ] 070/100 VUs  3m49.0s/6m00.0s

running (3m50.0s), 070/100 VUs, 1704 complete and 0 interrupted iterations
default   [  64% ] 070/100 VUs  3m50.0s/6m00.0s

running (3m51.0s), 071/100 VUs, 1719 complete and 0 interrupted iterations
default   [  64% ] 071/100 VUs  3m51.0s/6m00.0s

running (3m52.0s), 071/100 VUs, 1732 complete and 0 interrupted iterations
default   [  64% ] 071/100 VUs  3m52.0s/6m00.0s

running (3m53.0s), 072/100 VUs, 1741 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  3m53.0s/6m00.0s

running (3m54.0s), 072/100 VUs, 1760 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  3m54.0s/6m00.0s

running (3m55.0s), 072/100 VUs, 1768 complete and 0 interrupted iterations
default   [  65% ] 072/100 VUs  3m55.0s/6m00.0s

running (3m56.0s), 073/100 VUs, 1778 complete and 0 interrupted iterations
default   [  66% ] 073/100 VUs  3m56.0s/6m00.0s

running (3m57.0s), 073/100 VUs, 1792 complete and 0 interrupted iterations
default   [  66% ] 073/100 VUs  3m57.0s/6m00.0s

running (3m58.0s), 074/100 VUs, 1804 complete and 0 interrupted iterations
default   [  66% ] 074/100 VUs  3m58.0s/6m00.0s

running (3m59.0s), 074/100 VUs, 1816 complete and 0 interrupted iterations
default   [  66% ] 074/100 VUs  3m59.0s/6m00.0s

running (4m00.0s), 074/100 VUs, 1832 complete and 0 interrupted iterations
default   [  67% ] 074/100 VUs  4m00.0s/6m00.0s

running (4m01.0s), 075/100 VUs, 1840 complete and 0 interrupted iterations
default   [  67% ] 075/100 VUs  4m01.0s/6m00.0s

running (4m02.0s), 075/100 VUs, 1855 complete and 0 interrupted iterations
default   [  67% ] 075/100 VUs  4m02.0s/6m00.0s

running (4m03.0s), 076/100 VUs, 1865 complete and 0 interrupted iterations
default   [  67% ] 076/100 VUs  4m03.0s/6m00.0s

running (4m04.0s), 076/100 VUs, 1878 complete and 0 interrupted iterations
default   [  68% ] 076/100 VUs  4m04.0s/6m00.0s

running (4m05.0s), 077/100 VUs, 1887 complete and 0 interrupted iterations
default   [  68% ] 077/100 VUs  4m05.0s/6m00.0s

running (4m06.0s), 077/100 VUs, 1906 complete and 0 interrupted iterations
default   [  68% ] 077/100 VUs  4m06.0s/6m00.0s

running (4m07.0s), 077/100 VUs, 1915 complete and 0 interrupted iterations
default   [  69% ] 077/100 VUs  4m07.0s/6m00.0s

running (4m08.0s), 078/100 VUs, 1924 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  4m08.0s/6m00.0s

running (4m09.0s), 078/100 VUs, 1941 complete and 0 interrupted iterations
default   [  69% ] 078/100 VUs  4m09.0s/6m00.0s

running (4m10.0s), 079/100 VUs, 1953 complete and 0 interrupted iterations
default   [  69% ] 079/100 VUs  4m10.0s/6m00.0s

running (4m11.0s), 079/100 VUs, 1963 complete and 0 interrupted iterations
default   [  70% ] 079/100 VUs  4m11.0s/6m00.0s

running (4m12.0s), 079/100 VUs, 1980 complete and 0 interrupted iterations
default   [  70% ] 079/100 VUs  4m12.0s/6m00.0s

running (4m13.0s), 080/100 VUs, 1990 complete and 0 interrupted iterations
default   [  70% ] 080/100 VUs  4m13.0s/6m00.0s

running (4m14.0s), 080/100 VUs, 2001 complete and 0 interrupted iterations
default   [  71% ] 080/100 VUs  4m14.0s/6m00.0s

running (4m15.0s), 081/100 VUs, 2016 complete and 0 interrupted iterations
default   [  71% ] 081/100 VUs  4m15.0s/6m00.0s

running (4m16.0s), 081/100 VUs, 2027 complete and 0 interrupted iterations
default   [  71% ] 081/100 VUs  4m16.0s/6m00.0s

running (4m17.0s), 082/100 VUs, 2036 complete and 0 interrupted iterations
default   [  71% ] 082/100 VUs  4m17.0s/6m00.0s

running (4m18.0s), 082/100 VUs, 2054 complete and 0 interrupted iterations
default   [  72% ] 082/100 VUs  4m18.0s/6m00.0s

running (4m19.0s), 082/100 VUs, 2069 complete and 0 interrupted iterations
default   [  72% ] 082/100 VUs  4m19.0s/6m00.0s

running (4m20.0s), 083/100 VUs, 2076 complete and 0 interrupted iterations
default   [  72% ] 083/100 VUs  4m20.0s/6m00.0s

running (4m21.0s), 083/100 VUs, 2090 complete and 0 interrupted iterations
default   [  72% ] 083/100 VUs  4m21.0s/6m00.0s

running (4m22.0s), 084/100 VUs, 2100 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  4m22.0s/6m00.0s

running (4m23.0s), 084/100 VUs, 2114 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  4m23.0s/6m00.0s

running (4m24.0s), 084/100 VUs, 2125 complete and 0 interrupted iterations
default   [  73% ] 084/100 VUs  4m24.0s/6m00.0s

running (4m25.0s), 085/100 VUs, 2145 complete and 0 interrupted iterations
default   [  74% ] 085/100 VUs  4m25.0s/6m00.0s

running (4m26.0s), 085/100 VUs, 2155 complete and 0 interrupted iterations
default   [  74% ] 085/100 VUs  4m26.0s/6m00.0s

running (4m27.0s), 086/100 VUs, 2165 complete and 0 interrupted iterations
default   [  74% ] 086/100 VUs  4m27.0s/6m00.0s

running (4m28.0s), 086/100 VUs, 2180 complete and 0 interrupted iterations
default   [  74% ] 086/100 VUs  4m28.0s/6m00.0s

running (4m29.0s), 087/100 VUs, 2192 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  4m29.0s/6m00.0s

running (4m30.0s), 087/100 VUs, 2202 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  4m30.0s/6m00.0s

running (4m31.0s), 087/100 VUs, 2217 complete and 0 interrupted iterations
default   [  75% ] 087/100 VUs  4m31.0s/6m00.0s

running (4m32.0s), 088/100 VUs, 2232 complete and 0 interrupted iterations
default   [  76% ] 088/100 VUs  4m32.0s/6m00.0s

running (4m33.0s), 088/100 VUs, 2240 complete and 0 interrupted iterations
default   [  76% ] 088/100 VUs  4m33.0s/6m00.0s

running (4m34.0s), 089/100 VUs, 2253 complete and 0 interrupted iterations
default   [  76% ] 089/100 VUs  4m34.0s/6m00.0s

running (4m35.0s), 089/100 VUs, 2270 complete and 0 interrupted iterations
default   [  76% ] 089/100 VUs  4m35.0s/6m00.0s

running (4m36.0s), 089/100 VUs, 2285 complete and 0 interrupted iterations
default   [  77% ] 089/100 VUs  4m36.0s/6m00.0s

running (4m37.0s), 090/100 VUs, 2295 complete and 0 interrupted iterations
default   [  77% ] 090/100 VUs  4m37.0s/6m00.0s

running (4m38.0s), 090/100 VUs, 2309 complete and 0 interrupted iterations
default   [  77% ] 090/100 VUs  4m38.0s/6m00.0s

running (4m39.0s), 091/100 VUs, 2325 complete and 0 interrupted iterations
default   [  77% ] 091/100 VUs  4m39.0s/6m00.0s

running (4m40.0s), 091/100 VUs, 2333 complete and 0 interrupted iterations
default   [  78% ] 091/100 VUs  4m40.0s/6m00.0s

running (4m41.0s), 092/100 VUs, 2347 complete and 0 interrupted iterations
default   [  78% ] 092/100 VUs  4m41.0s/6m00.0s

running (4m42.0s), 092/100 VUs, 2359 complete and 0 interrupted iterations
default   [  78% ] 092/100 VUs  4m42.0s/6m00.0s

running (4m43.0s), 092/100 VUs, 2375 complete and 0 interrupted iterations
default   [  79% ] 092/100 VUs  4m43.0s/6m00.0s

running (4m44.0s), 093/100 VUs, 2386 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  4m44.0s/6m00.0s

running (4m45.0s), 093/100 VUs, 2405 complete and 0 interrupted iterations
default   [  79% ] 093/100 VUs  4m45.0s/6m00.0s

running (4m46.0s), 094/100 VUs, 2417 complete and 0 interrupted iterations
default   [  79% ] 094/100 VUs  4m46.0s/6m00.0s

running (4m47.0s), 094/100 VUs, 2426 complete and 0 interrupted iterations
default   [  80% ] 094/100 VUs  4m47.0s/6m00.0s

running (4m48.0s), 094/100 VUs, 2441 complete and 0 interrupted iterations
default   [  80% ] 094/100 VUs  4m48.0s/6m00.0s

running (4m49.0s), 095/100 VUs, 2452 complete and 0 interrupted iterations
default   [  80% ] 095/100 VUs  4m49.0s/6m00.0s

running (4m50.0s), 095/100 VUs, 2467 complete and 0 interrupted iterations
default   [  81% ] 095/100 VUs  4m50.0s/6m00.0s

running (4m51.0s), 096/100 VUs, 2479 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  4m51.0s/6m00.0s

running (4m52.0s), 096/100 VUs, 2498 complete and 0 interrupted iterations
default   [  81% ] 096/100 VUs  4m52.0s/6m00.0s

running (4m53.0s), 097/100 VUs, 2511 complete and 0 interrupted iterations
default   [  81% ] 097/100 VUs  4m53.0s/6m00.0s

running (4m54.0s), 097/100 VUs, 2521 complete and 0 interrupted iterations
default   [  82% ] 097/100 VUs  4m54.0s/6m00.0s

running (4m55.0s), 097/100 VUs, 2536 complete and 0 interrupted iterations
default   [  82% ] 097/100 VUs  4m55.0s/6m00.0s

running (4m56.0s), 098/100 VUs, 2547 complete and 0 interrupted iterations
default   [  82% ] 098/100 VUs  4m56.0s/6m00.0s

running (4m57.0s), 098/100 VUs, 2562 complete and 0 interrupted iterations
default   [  82% ] 098/100 VUs  4m57.0s/6m00.0s

running (4m58.0s), 099/100 VUs, 2575 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  4m58.0s/6m00.0s

running (4m59.0s), 099/100 VUs, 2594 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  4m59.0s/6m00.0s

running (5m00.0s), 099/100 VUs, 2608 complete and 0 interrupted iterations
default   [  83% ] 099/100 VUs  5m00.0s/6m00.0s

running (5m01.0s), 100/100 VUs, 2617 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  5m01.0s/6m00.0s

running (5m02.0s), 100/100 VUs, 2631 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  5m02.0s/6m00.0s

running (5m03.0s), 099/100 VUs, 2645 complete and 0 interrupted iterations
default   [  84% ] 099/100 VUs  5m03.0s/6m00.0s

running (5m04.0s), 099/100 VUs, 2660 complete and 0 interrupted iterations
default   [  84% ] 099/100 VUs  5m04.0s/6m00.0s

running (5m05.0s), 097/100 VUs, 2674 complete and 0 interrupted iterations
default   [  85% ] 097/100 VUs  5m05.0s/6m00.0s

running (5m06.0s), 097/100 VUs, 2688 complete and 0 interrupted iterations
default   [  85% ] 097/100 VUs  5m06.0s/6m00.0s

running (5m07.0s), 094/100 VUs, 2707 complete and 0 interrupted iterations
default   [  85% ] 094/100 VUs  5m07.0s/6m00.0s

running (5m08.0s), 093/100 VUs, 2717 complete and 0 interrupted iterations
default   [  86% ] 093/100 VUs  5m08.0s/6m00.0s

running (5m09.0s), 091/100 VUs, 2731 complete and 0 interrupted iterations
default   [  86% ] 091/100 VUs  5m09.0s/6m00.0s

running (5m10.0s), 090/100 VUs, 2744 complete and 0 interrupted iterations
default   [  86% ] 090/100 VUs  5m10.0s/6m00.0s

running (5m11.0s), 088/100 VUs, 2761 complete and 0 interrupted iterations
default   [  86% ] 088/100 VUs  5m11.0s/6m00.0s

running (5m12.0s), 086/100 VUs, 2772 complete and 0 interrupted iterations
default   [  87% ] 086/100 VUs  5m12.0s/6m00.0s

running (5m13.0s), 084/100 VUs, 2793 complete and 0 interrupted iterations
default   [  87% ] 084/100 VUs  5m13.0s/6m00.0s

running (5m14.0s), 083/100 VUs, 2803 complete and 0 interrupted iterations
default   [  87% ] 083/100 VUs  5m14.0s/6m00.0s

running (5m15.0s), 081/100 VUs, 2814 complete and 0 interrupted iterations
default   [  87% ] 081/100 VUs  5m15.0s/6m00.0s

running (5m16.0s), 078/100 VUs, 2833 complete and 0 interrupted iterations
default   [  88% ] 078/100 VUs  5m16.0s/6m00.0s

running (5m17.0s), 076/100 VUs, 2846 complete and 0 interrupted iterations
default   [  88% ] 076/100 VUs  5m17.0s/6m00.0s

running (5m18.0s), 073/100 VUs, 2858 complete and 0 interrupted iterations
default   [  88% ] 073/100 VUs  5m18.0s/6m00.0s

running (5m19.0s), 072/100 VUs, 2877 complete and 0 interrupted iterations
default   [  89% ] 072/100 VUs  5m19.0s/6m00.0s

running (5m20.0s), 071/100 VUs, 2886 complete and 0 interrupted iterations
default   [  89% ] 071/100 VUs  5m20.0s/6m00.0s

running (5m21.0s), 070/100 VUs, 2897 complete and 0 interrupted iterations
default   [  89% ] 070/100 VUs  5m21.0s/6m00.0s

running (5m22.0s), 067/100 VUs, 2912 complete and 0 interrupted iterations
default   [  89% ] 067/100 VUs  5m22.0s/6m00.0s

running (5m23.0s), 067/100 VUs, 2926 complete and 0 interrupted iterations
default   [  90% ] 067/100 VUs  5m23.0s/6m00.0s

running (5m24.0s), 067/100 VUs, 2942 complete and 0 interrupted iterations
default   [  90% ] 067/100 VUs  5m24.0s/6m00.0s

running (5m25.0s), 063/100 VUs, 2957 complete and 0 interrupted iterations
default   [  90% ] 063/100 VUs  5m25.0s/6m00.0s

running (5m26.0s), 062/100 VUs, 2972 complete and 0 interrupted iterations
default   [  91% ] 062/100 VUs  5m26.0s/6m00.0s

running (5m27.0s), 059/100 VUs, 2984 complete and 0 interrupted iterations
default   [  91% ] 059/100 VUs  5m27.0s/6m00.0s

running (5m28.0s), 058/100 VUs, 2999 complete and 0 interrupted iterations
default   [  91% ] 058/100 VUs  5m28.0s/6m00.0s

running (5m29.0s), 055/100 VUs, 3013 complete and 0 interrupted iterations
default   [  91% ] 055/100 VUs  5m29.0s/6m00.0s

running (5m30.0s), 053/100 VUs, 3028 complete and 0 interrupted iterations
default   [  92% ] 053/100 VUs  5m30.0s/6m00.0s

running (5m31.0s), 052/100 VUs, 3038 complete and 0 interrupted iterations
default   [  92% ] 052/100 VUs  5m31.0s/6m00.0s

running (5m32.0s), 050/100 VUs, 3056 complete and 0 interrupted iterations
default   [  92% ] 050/100 VUs  5m32.0s/6m00.0s

running (5m33.0s), 048/100 VUs, 3068 complete and 0 interrupted iterations
default   [  92% ] 048/100 VUs  5m33.0s/6m00.0s

running (5m34.0s), 045/100 VUs, 3081 complete and 0 interrupted iterations
default   [  93% ] 045/100 VUs  5m34.0s/6m00.0s

running (5m35.0s), 045/100 VUs, 3090 complete and 0 interrupted iterations
default   [  93% ] 045/100 VUs  5m35.0s/6m00.0s

running (5m36.0s), 043/100 VUs, 3106 complete and 0 interrupted iterations
default   [  93% ] 043/100 VUs  5m36.0s/6m00.0s

running (5m37.0s), 042/100 VUs, 3116 complete and 0 interrupted iterations
default   [  94% ] 042/100 VUs  5m37.0s/6m00.0s

running (5m38.0s), 041/100 VUs, 3126 complete and 0 interrupted iterations
default   [  94% ] 041/100 VUs  5m38.0s/6m00.0s

running (5m39.0s), 040/100 VUs, 3135 complete and 0 interrupted iterations
default   [  94% ] 040/100 VUs  5m39.0s/6m00.0s

running (5m40.0s), 039/100 VUs, 3151 complete and 0 interrupted iterations
default   [  94% ] 039/100 VUs  5m40.0s/6m00.0s

running (5m41.0s), 036/100 VUs, 3163 complete and 0 interrupted iterations
default   [  95% ] 036/100 VUs  5m41.0s/6m00.0s

running (5m42.0s), 035/100 VUs, 3174 complete and 0 interrupted iterations
default   [  95% ] 035/100 VUs  5m42.0s/6m00.0s

running (5m43.0s), 033/100 VUs, 3185 complete and 0 interrupted iterations
default   [  95% ] 033/100 VUs  5m43.0s/6m00.0s

running (5m44.0s), 031/100 VUs, 3195 complete and 0 interrupted iterations
default   [  96% ] 031/100 VUs  5m44.0s/6m00.0s

running (5m45.0s), 029/100 VUs, 3203 complete and 0 interrupted iterations
default   [  96% ] 029/100 VUs  5m45.0s/6m00.0s

running (5m46.0s), 027/100 VUs, 3209 complete and 0 interrupted iterations
default   [  96% ] 027/100 VUs  5m46.0s/6m00.0s

running (5m47.0s), 024/100 VUs, 3222 complete and 0 interrupted iterations
default   [  96% ] 024/100 VUs  5m47.0s/6m00.0s

running (5m48.0s), 021/100 VUs, 3229 complete and 0 interrupted iterations
default   [  97% ] 021/100 VUs  5m48.0s/6m00.0s

running (5m49.0s), 020/100 VUs, 3236 complete and 0 interrupted iterations
default   [  97% ] 020/100 VUs  5m49.0s/6m00.0s

running (5m50.0s), 020/100 VUs, 3246 complete and 0 interrupted iterations
default   [  97% ] 020/100 VUs  5m50.0s/6m00.0s

running (5m51.0s), 020/100 VUs, 3250 complete and 0 interrupted iterations
default   [  97% ] 020/100 VUs  5m51.0s/6m00.0s

running (5m52.0s), 016/100 VUs, 3256 complete and 0 interrupted iterations
default   [  98% ] 016/100 VUs  5m52.0s/6m00.0s

running (5m53.0s), 013/100 VUs, 3263 complete and 0 interrupted iterations
default   [  98% ] 013/100 VUs  5m53.0s/6m00.0s

running (5m54.0s), 013/100 VUs, 3269 complete and 0 interrupted iterations
default   [  98% ] 013/100 VUs  5m54.0s/6m00.0s

running (5m55.0s), 013/100 VUs, 3272 complete and 0 interrupted iterations
default   [  99% ] 013/100 VUs  5m55.0s/6m00.0s

running (5m56.0s), 010/100 VUs, 3276 complete and 0 interrupted iterations
default   [  99% ] 010/100 VUs  5m56.0s/6m00.0s

running (5m57.0s), 008/100 VUs, 3281 complete and 0 interrupted iterations
default   [  99% ] 008/100 VUs  5m57.0s/6m00.0s

running (5m58.0s), 006/100 VUs, 3285 complete and 0 interrupted iterations
default   [  99% ] 006/100 VUs  5m58.0s/6m00.0s

running (5m59.0s), 005/100 VUs, 3286 complete and 0 interrupted iterations
default   [ 100% ] 005/100 VUs  5m59.0s/6m00.0s

running (6m00.0s), 003/100 VUs, 3289 complete and 0 interrupted iterations
default   [ 100% ] 003/100 VUs  6m00.0s/6m00.0s

running (6m01.0s), 001/100 VUs, 3291 complete and 0 interrupted iterations
default ↓ [ 100% ] 003/100 VUs  6m0s

running (6m02.0s), 001/100 VUs, 3291 complete and 0 interrupted iterations
default ↓ [ 100% ] 003/100 VUs  6m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<10000' p(95)=6.49s

    http_req_failed
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 3292    9.090114/s
    checks_succeeded...: 100.00% 3292 out of 3292
    checks_failed......: 0.00%   0 out of 3292

    ✓ status 200

    CUSTOM
    tokens_per_sec.................: avg=32.262852 min=19.354417 med=31.82276 max=53.038296 p(90)=45.489392 p(95)=49.053219
    total_tokens...................: 421376 1163.534557/s

    HTTP
    http_req_duration..............: avg=4.36s     min=2.41s     med=4.02s    max=6.61s     p(90)=6.37s     p(95)=6.49s    
      { expected_response:true }...: avg=4.36s     min=2.41s     med=4.02s    max=6.61s     p(90)=6.37s     p(95)=6.49s    
    http_req_failed................: 0.00%  0 out of 3292
    http_reqs......................: 3292   9.090114/s

    EXECUTION
    iteration_duration.............: avg=4.87s     min=2.91s     med=4.52s    max=7.11s     p(90)=6.87s     p(95)=7s       
    iterations.....................: 3292   9.090114/s
    vus............................: 1      min=1         max=100
    vus_max........................: 100    min=100       max=100

    NETWORK
    data_received..................: 4.3 MB 12 kB/s
    data_sent......................: 1.0 MB 2.8 kB/s



running (6m02.2s), 000/100 VUs, 3292 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  6m0s